import requests
from hashlib import md5
import xmltodict
import pprint
from bs4 import BeautifulSoup


# url = "http://192.168.73.2:8686"
# headers = {
#     "X-Login": "potapov",
#     "X-Password": md5("sql".encode("utf-8")).hexdigest().upper(),
#     "X-ReqInitiator": "ADMIN_UI"
# }
#
# resp = requests.get(url=url+"/card_service?method=get_card_state_info&msisdn=79130000000", headers=headers)
# soup = BeautifulSoup(resp.content, "lxml")
# print(soup.prettify())

"""
Сервис по работе со сим-картой

        Блокировка (административная) карты
        Блокировка (добровольная) карты
        Разблокировка (административная) карты
        Разблокировка (добровольная) карты
        Получение базовой информации о карте
        Получение информации о состоянии карты
        Получение информации о состоянии карты без пин пак
        Смена статуса номера
        Изменение msisdn карты
        Удаление списка карт
        Изменение языка карты
        Восстановление карты
        Получение всех msisdn по imsi
        Получение языка карты
        Замена карты
        Смена клиента
        Удаление списка карт с расширенным результатом
        Проверка HLR профиля
        Смена состояния проверки карты
        Перевод номера из отстоя
        Получение данных по регистрации абонента на HLR
        Изменение дополнительной информации на карте
        Активация карты
        Создание счетчика расходов по карте
        Удаление счетчика расходов по карте
        Просмотр состояния счетчиков расходов по карте
        Получение списка неактивных карт
        Переход номера к другому оператору
        Получение информации о состоянии карты включая неоплаченные инвойсы


"""
